# Exercício aula 01

In [1]:
import pandas as pd

## Série a partir de listas

In [2]:
alunos = ['João', 'Maria', 'Pedro', 'Ana']
notas = [15, 18, 14, 19]

serie_notas = pd.Series(notas, index=alunos)
print(serie_notas)

João     15
Maria    18
Pedro    14
Ana      19
dtype: int64

## DataFrame a partir de dicionários

In [8]:
dados = {
    'Nome': ['João', 'Maria', 'Pedro', 'Ana'],
    'Idade': [25, 30, 22, 28],
    'Cidade': ['Braga', 'Porto', 'Lisboa', 'Coimbra']
}

df = pd.DataFrame(dados)
print(df)

    Nome  Idade   Cidade
0   João     25    Braga
1  Maria     30    Porto
2  Pedro     22   Lisboa
3    Ana     28  Coimbra

Extrair uma série a partir do dataframe

In [4]:
df['Nome']

0     João
1    Maria
2    Pedro
3      Ana
Name: Nome, dtype: object

## DataFrames a partir de lista com atribuição dos nomes das colunas

In [47]:
dados = [
    ['João', 25, 'Braga'],
    ['Maria', 30, 'Porto'],
    ['Pedro', 22, 'Lisboa'],
    ['Ana', 22, 'Coimbra'],
]

df = pd.DataFrame(dados, columns=['Nome', 'Idade', 'Cidade'])
print(df)

    Nome  Idade   Cidade
0   João     25    Braga
1  Maria     30    Porto
2  Pedro     22   Lisboa
3    Ana     22  Coimbra

Seleccionar a primeira linha

In [35]:
print(df.iloc[0])

Nome       João
Idade        25
Cidade    Braga
Name: 0, dtype: object

In [36]:
df

    Nome  Idade   Cidade
0   João     25    Braga
1  Maria     30    Porto
2  Pedro     22   Lisboa
3    Ana     22  Coimbra

Filtrar dados

In [37]:
print(df[df['Nome'] == 'Maria'])

    Nome  Idade Cidade
1  Maria     30  Porto

Filtrar dados

In [38]:
print(df[df['Idade'] > 25])

    Nome  Idade Cidade
1  Maria     30  Porto

## Operações Fundamentais com DataFrames

### index

In [ ]:
# df.index = ['a', 'b', 'c']
# df.set_index('Nome', inplace=True)
# df.ser_index(['Nome'], inplace=True)
# df.reset_index(inplace=True)

In [51]:
dados = {
    'Nome': ['João', 'Maria', 'Pedro', 'Ana'],
    'Idade': [25, 30, 22, 28],
    'Cidade': ['Braga', 'Porto', 'Lisboa', 'Coimbra']
}

df = pd.DataFrame(dados)
print(df)

    Nome  Idade   Cidade
0   João     25    Braga
1  Maria     30    Porto
2  Pedro     22   Lisboa
3    Ana     28  Coimbra

In [49]:
print('DataFrame original')
print(df)

print('DataFrame com índices alterados')
df.index = ['a', 'b', 'c', 'd']
print(df)

print('DataFrame com índices restaurados')
df.reset_index(inplace=True)
print(df)

DataFrame original
  index   Nome  Idade   Cidade
0     a   João     25    Braga
1     b  Maria     30    Porto
2     c  Pedro     22   Lisboa
3     d    Ana     22  Coimbra
DataFrame com índices alterados
  index   Nome  Idade   Cidade
a     a   João     25    Braga
b     b  Maria     30    Porto
c     c  Pedro     22   Lisboa
d     d    Ana     22  Coimbra
DataFrame com índices restaurados
  level_0 index   Nome  Idade   Cidade
0       a     a   João     25    Braga
1       b     b  Maria     30    Porto
2       c     c  Pedro     22   Lisboa
3       d     d    Ana     22  Coimbra

In [52]:
dados = {
    'Nome': ['João', 'Maria', 'Pedro', 'Ana'],
    'Idade': [25, 30, 22, 28],
    'Cidade': ['Braga', 'Porto', 'Lisboa', 'Coimbra']
}

df = pd.DataFrame(dados)
print(df)

    Nome  Idade   Cidade
0   João     25    Braga
1  Maria     30    Porto
2  Pedro     22   Lisboa
3    Ana     28  Coimbra

In [53]:
print('DataFrame original')
print(df)

print('DataFrame com índices alterados para uma das colunas')
df.set_index(['Nome'], inplace=True)
print(df)

print('DataFrame com índices restaurados')
df.reset_index()

DataFrame original
    Nome  Idade   Cidade
0   João     25    Braga
1  Maria     30    Porto
2  Pedro     22   Lisboa
3    Ana     28  Coimbra
DataFrame com índices alterados para uma das colunas
       Idade   Cidade
Nome
João      25    Braga
Maria     30    Porto
Pedro     22   Lisboa
Ana       28  Coimbra
DataFrame com índices restaurados

    Nome  Idade   Cidade
0   João     25    Braga
1  Maria     30    Porto
2  Pedro     22   Lisboa
3    Ana     28  Coimbra

## Inspeção de Dados

In [56]:
# estrutura e dimensão
df.shape

(4, 2)

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, João to Ana
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Idade   4 non-null      int64
 1   Cidade  4 non-null      object
dtypes: int64(1), object(1)
memory usage: 268.0+ bytes

In [60]:
# Resumo estatístico
df.describe()

       Idade
count   4.00
mean   26.25
std     3.50
min    22.00
25%    24.25
50%    26.50
75%    28.50
max    30.00

In [58]:
# Valores ausentes
df.isnull().sum()

Idade     0
Cidade    0
dtype: int64

In [59]:
# Coerência de dados
df.dtypes

Idade      int64
Cidade    object
dtype: object

In [63]:
## dropna()
df.dropna()

       Idade   Cidade
Nome
João      25    Braga
Maria     30    Porto
Pedro     22   Lisboa
Ana       28  Coimbra

In [64]:
# fillna()
df.fillna(0)

       Idade   Cidade
Nome
João      25    Braga
Maria     30    Porto
Pedro     22   Lisboa
Ana       28  Coimbra

## Manipulação e Transformação de Dados

In [ ]:
# pd.concat()
# pd.merge()

### Agrupar e Agregar

In [ ]:
# df.groupby('Região')['Vendas'].sum()
# .apply()